/* Написать программу, которая из имеющегося массива строк формирует 
массив из строк, длинна которого меньше либо задать на старте выполнения
алгоритма. */


Messager("Введите кол-во слов в массиве: ");
//string [] arrayStrings = new arrayStrings [InputNumberLine()];

// Функция преднозначеная для вывода сообщений
void Messager(string message)
{
    Console.Write(message);
}

//