/* Написать программу, которая из имеющегося массива строк формирует 
массив из строк, длинна которого меньше либо задать на старте выполнения
алгоритма. */

Messager("Привет");


void Messager(string message)
{
    Console.WriteLine(message);
}